; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 388939 1 3 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation4 - direction
	Star2 - direction
	Star0 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(have_image Star6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Planet8 infrared1)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
5. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 0 of 5
6. (take_image satellite0 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 1 of 5
7. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 1 of 5
8. (turn_to satellite0 phenomenon10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 5
9. (take_image satellite0 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 2 of 5
10. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 5
11. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   goals met: 2 of 5
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 5
13. (turn_to satellite0 groundstation4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 5
14. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 5
15. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 2 of 5
16. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 3 of 5
17. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 3 of 5
18. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 4 of 5
19. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 4 of 5
20. (take_image satellite0 planet9 instrument0 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 5 of 5
